zeroWin/BP_MSP430/main.c
//******************************************************************************
//  MSP430F149-Noninvasive Blood Pressure Monitor
//  Nov 2013
//  Built with IAR Embedded Workbench Version: 5.3
//******************************************************************************
#include  <msp430x14x.h>
#include  <math.h>
#include  "typedefs.h"
#include "oled_main.h"
/*****************************************************************************
宏定义
******************************************************************************/
#define DEVICE_SLEEP    0x00                       //睡眠状态
#define DEVICE_WAIT     0x01                       //等待状态
#define DEVICE_MEASURE  0x02                       //测量状态
/*****************************************************************************
变量定义
******************************************************************************/
u32 BP_DC;
u32 BP_AC;
u16 BP_MAX;
u16 BP_MIN;
u16 AC_MAX;
int BP_MID;
int BP_P2P;
int BP_Low;
int BP_High;
float k1=0;
float k2=0;
float abp=0;
float bp;
int SYS;
int DIA;
u32 pressure;
int display_time=0;
u8  show=0;
struct Pointss
{
  int bp;
  int p2p;
} Points[100];                                     //DC、AC矩阵
unsigned int n_P=0;                                //number of points
unsigned int last_is_low=0;
unsigned char is_BP_messure_finished=0;            //血压测量结束了吗？
unsigned int delay_times=0;
unsigned char step=101;
char command;
int value1;
int ch1;
int value2;
int ch2;
int value3;
int ch3;
int value4;
int ch4;
unsigned char const hello[4]={0x4B,0x3A,0x1F,0x2E};//串口握手协议
unsigned char RBUF[8];
unsigned char R_SP=0;
unsigned char RBUF_NEED_PROCESS=0;
int Prepressure=3500;
//int Prepressure=4000;
int Device_status;                                 //默认等待状态
int Device_waite_time1;
/*****************************************************************************
函数声明
*****************************************************************************/
void Init_Clock();
void Init_Port1();
void Init_Port2();
void Init_Port3();
void Init_Port4();
void Init_Port5();
void Init_Port6();
void Init_TimerA();
extern void usDelay(int microeconds);
extern void Write_8402(u16 data_8402);
extern void delay_ms(u16 nms);
extern void delay_s(u16 ns);
extern void PUMP_ON(u16 motorspeed);
extern void PUMP_OFF(void);
extern void VALVE_ON(void);
extern void VALVE_OFF(void);
extern void write_oled_command(unsigned char ucCmd);
extern void write_oled_data(unsigned char ucData);
unsigned int adc2mmhg(unsigned int adc);
void RBUF_PROCESS(void);
int abs(int a);
void Find_Hign_Low_BP();
/*****************************************************************************
主程序
*****************************************************************************/
void main(void)
{
       int i;
       WDTCTL = WDTPW + WDTHOLD;                //关闭看门狗电路
       Device_status = DEVICE_WAIT;             //默认普通显示状态
       Init_Clock();
       Init_Port1();
       Init_Port2();
       P2OUT &= ~BIT4;
       Init_Port3();
       Init_Port4();
       Init_Port6();                             
       //VALVE_OFF();                             //通道0 控制电磁阀
       VALVE_ON();
       PUMP_OFF();                              //通道1 控制气泵
       Init_TimerA();
       step=101;
       oledinit();
       OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
       OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
       Show_Wait_Symbol();    
       OLED_Refresh_Gram();
       delay_ms(10);        
       _EINT();      
       while(1)
            {
              if(Device_status == DEVICE_WAIT)             //等待状态
              {                                              
                  //step=101;
                  OLED_SLEEP(0);                           //打开显示器 
                  if(Device_waite_time1 <15000)
                    {
                      delay_ms(2);
                      Device_waite_time1++;
                    }
                  else                                     //等待15s，如果无操作则进入休眠状态
                    Device_status = DEVICE_SLEEP;
               }
              else if(Device_status == DEVICE_SLEEP)       //进入睡眠状态
              {
                //step=101;
                OLED_SLEEP(1);                             //关闭显示器        
                CCTL0 &= ~CCIE;                            //关闭定时器中断
                _BIS_SR(LPM0_bits + GIE);                  //进入低功耗
              }
              else if(Device_status == DEVICE_MEASURE)     //测量状态
              {
                if(RBUF_NEED_PROCESS)
                {
                  RBUF_PROCESS();
                }
                if(step==30)
                {
                  Find_Hign_Low_BP();                    //计算高低血压值
                  value3=BP_High;                        //收缩压
                  ch3=(value3&0x00FF);
                  value4=BP_Low;
                  ch4=(value4&0x00FF);
                  TXBUF0 = 0xEF;
                  while(!(U0TCTL & TXEPT));
                  TXBUF0 = 0x12;
                  while(!(U0TCTL & TXEPT));
                  TXBUF0 = ch3;
                  while(!(U0TCTL & TXEPT));
                  TXBUF0 = ch4;
                  while(!(U0TCTL & TXEPT));
                  TXBUF0 = 0x12;
                  while(!(U0TCTL & TXEPT));
                  TXBUF0 = 0xEF;
                  while(!(U0TCTL & TXEPT));
                                                       //发送数据
                  for(i=0;i<120;i++)
                  {
                    while(!(U0TCTL & TXEPT));
                    TXBUF0 = 0x00;
                    while(!(U0TCTL & TXEPT));
                  }  
                  is_BP_messure_finished=1;
                  step=40;                  
                  //delay_s(2);
                  CCTL0 &= ~CCIE;                       //关闭定时器A中断
                  OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Finished");
                  OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
                  if(BP_High<100)
                    OLED_ShowNum(SPO2_Show2Num_Start_X,SPO2_Show2Num_Start_Y,BP_High,2,32);              
                  else
                    OLED_ShowNum(SPO2_Show3Num_Start_X,SPO2_Show3Num_Start_Y,BP_High,3,32);
                  if(BP_Low < 100)
                    OLED_ShowNum(HR_Show2Num_Start_X,HR_Show2Num_Start_Y,BP_Low,2,32);              
                  else
                    OLED_ShowNum(HR_Show3Num_Start_X ,HR_Show3Num_Start_Y,BP_Low,3,32);
                  OLED_Refresh_Gram();                  
                  //delay_s(50);
                  //OLED_Clear();
                  //Device_status = DEVICE_WAIT;
                  
