zeroWin/BP_MSP430/main.c
                 }
               } 
            }              
}
/*****************************************************************************
MSP430单片机时钟初始化
*****************************************************************************/
void Init_Clock()
{ 
       unsigned int i;
       BCSCTL1 = 0X00;			//将寄存器的内容清零
					//XT2震荡器开启
					//LFTX1工作在低频模式
					//ACLK的分频因子为1				
       do 
       {
	   IFG1 &= ~OFIFG;              // 清除OSCFault标志
	   for (i = 0xFF; i > 0; i--);                
       }
       while ((IFG1 & OFIFG) == OFIFG); // 如果OSCFault =1   
					
       BCSCTL2 = 0X00;			//将寄存器的内容清零
       BCSCTL2 = SELM_2 + SELS;		//MCLK的时钟源为TX2CLK，分频因子为1
                         		//SMCLK的时钟源为TX2CLK，分频因子为1
}
/*****************************************************************************
端口P1初始化
*****************************************************************************/
void Init_Port1()
{
       P1DIR |= BIT0; //P1.0输出 AD8402   CLK
       P1DIR |= BIT1; //P1.1输出 AD8402   SDI
       P1DIR |= BIT2; //P1.2输出 AD8402   CS
       P1DIR &= ~BIT3;//P1.3按键S2 
       P1IES |=  BIT3;//捕捉下降沿中断                          		
       P1IFG &= ~BIT3;//IFG清零                           	
       P1IE  |=  BIT3;//中断使能  
}
/*****************************************************************************
端口P2初始化
*****************************************************************************/
void Init_Port2()
{
       P2DIR |= BIT0;//P2.0输出 控制电磁阀放气
       P2DIR |= BIT1;//P2.1输出 控制电磁阀放气
       P2DIR |= BIT3;//P2.3输出 控制蜂鸣器
       P2OUT |= BIT3;
       P2DIR |= BIT4;//P2.4输出 LED D5
       P2DIR |= BIT5;//P2.5输出 DS1302 RST
       P2DIR |= BIT6;//P2.6输出 DS1302 I/O
       P2DIR |= BIT7;//P2.7输出 DS1302 SCLK
}
/*****************************************************************************
端口P3初始化 UART
*****************************************************************************/
void Init_Port3()
{
       P3SEL |= 0x30;                          //P3.4 P3.5配置为UART
       UCTL0 &= ~SWRST;
       ME1 |= UTXE0 + URXE0;                   // Enable USART0 TXD/RXD
       UCTL0 |= CHAR;                          // 8-bit character
       UTCTL0 |= SSEL1;                        // UCLK = ACLK
       UBR00 = 0xD0;                           // 32k/9600 - 3.41
       UBR10 = 0x00;                           
       UMCTL0 = 0x00;                          // Modulation 
       UCTL0 &= ~SWRST;                        // Initialize USART state machine
       IE1 |= URXIE0;                          // Enable USART0 RX/TX interrupt 
}
/*****************************************************************************
端口P4初始化
*****************************************************************************/
void Init_Port4()
{
       P4DIR |= BIT0;                           //OLED CSB
       P4OUT |= BIT0;
       P4DIR |= BIT1;                           //OLED RESB
       P4OUT |= BIT1;
       P4DIR |= BIT2;                           //OLED D/C#;
       P4OUT |= BIT2;
       P4DIR |= BIT3;                           //OLED D0---------->SCLK
       P4OUT |= BIT3;                           
       P4DIR |= BIT4;                           //OLED D1---------->SDIN
       P4OUT |= BIT4;       
}
/*****************************************************************************
端口P5初始化
*****************************************************************************/
void Init_Port5()
{
       P5DIR |= BIT0;                            //microsd CSB
       P5OUT |= BIT0;
       P5SEL |= 0x0E;                            // P5.1,2,3 SPI option select
       P5OUT &= ~0x01;
       P5DIR |= 0x01;                            //Reset Slave
       P5DIR &= ~0x01;
       U1CTL = CHAR + SYNC + MM + SWRST;         // 8-bit, SPI, Master
       U1TCTL = CKPL + SSEL1 + STC;              // Polarity, SMCLK, 3-wire
       U1BR0 = 0x02;                             // SPICLK = SMCLK/2
       U1BR1 = 0x00;
       U1MCTL = 0x00;
       ME2 |= USPIE1;                            // Module enable
       U1CTL &= ~SWRST;                          // SPI enable
       IE2 |= URXIE1 + UTXIE1;                   // RX and TX interrupt enable
}
/*****************************************************************************
端口P6初始化 ADC
*****************************************************************************/
void Init_Port6()
{
       P6SEL = 0x03;                    // Enable A/D channel inputs
       ADC12CTL0 = ADC12ON+MSC+SHT0_2;  //+REFON+ REF2_5V;//+SHT0_8;//+REFON+ REF2_5V; 
                                        // Turn on ADC12, extend sampling time 
                                        // to avoid overflow of results
       ADC12CTL1 = SHP+CONSEQ_1;        // Use sampling timer, repeated sequence
       ADC12MCTL0 = INCH_0+SREF_0;      // ref+=AVcc, channel = A0
       ADC12MCTL1 = INCH_1+EOS+SREF_0;  // ref+=AVcc, channel = A1
       //ADC12IE = 0x02;                // Enable ADC12IFG.3
       ADC12CTL0 |= ENC;                // Enable conversions
}
/*****************************************************************************
定时器A初始化
*****************************************************************************/
void Init_TimerA()
{
       CCTL0 &= ~CCIE;                           // CCR0 interrupt Disabled
       CCR0 = 64-1;                              //256,定时器每秒产生中断256次
       TACTL = TASSEL_1 + MC_1;                  // SMCLK, upmode
}
/*****************************************************************************
气泵开
*****************************************************************************/
void PUMP_ON(u16 motorspeed)
{
       Write_8402(motorspeed);    
}
/*****************************************************************************
气泵关
*****************************************************************************/
void PUMP_OFF(void)
{
       Write_8402(0x01ffu);    
}
/*****************************************************************************
电磁阀打开
*****************************************************************************/
void VALVE_ON(void)
{
       P2OUT |= BIT0;
       P2OUT |= BIT1;
}
/*****************************************************************************
电磁阀关闭
*****************************************************************************/
void VALVE_OFF(void)
{
       P2OUT &= ~BIT0;
       P2OUT &= ~BIT1;
}
/*****************************************************************************
数字电位器控制子程序
*****************************************************************************/
void Write_8402(u16 data_8402)	 
{
       int i;
       P1OUT &= ~BIT2;                     //CS=0
       data_8402 <<= 6;
       for(i=10;i>0;i--)
	{
	  P1OUT &= ~BIT0;                  //CLK=0
	  if(data_8402&0x8000)
             P1OUT |= BIT1;                //SDI赋值
          else
             P1OUT &= ~BIT1;
             data_8402 <<= 1; 
             P1OUT |= BIT0;
             usDelay(1);
         }
       P1OUT &= ~BIT0;
       usDelay(1); 	
       P1OUT |= BIT2;
}
/*****************************************************************************
延时子程序
*****************************************************************************/
void usDelay(int microeconds)
{
       do
       {
           _NOP(); 
           _NOP();
       }while (--microeconds > 0);
}
void delay_ms(u16 nms)
{
       u16 i;
       u16 j;
       _NOP();
       for (j=0;j<nms;j++)
       {
          for (i=0;i<1335;i++)       
             {
                _NOP();
             }
       }  
}
void delay_s(u16 ns)
{
       u16 i;
       u16 j;
       _NOP();
       for (j=0;j<ns;j++)
       {
          for (i=0;i<5;i++) 
             {
                delay_ms(200);
             }
       }   
}

/*****************************************************************************
电压-压力转换
*****************************************************************************/
unsigned int adc2mmhg(unsigned int adc)
{
  abp=((adc*3.3/4095)/233.56)*1000*15.52;
  return (int)(abp);
  //return (int)((adc*3.3/4095)/233.56)*1000*15.52;
}
/*****************************************************************************
绝对值函数
*****************************************************************************/
int abs(int a)
{
if(a<0)a=-a;
return a;
}
/*****************************************************************************
收缩压舒张压计算
*****************************************************************************/
void Find_Hign_Low_BP()
{
  unsigned int p2p_max=0,n_max=0;
  unsigned int p2p_min=65535;  
  unsigned int i=0;  
  unsigned int high,low;  
  int tmp_v[100];  
  //--------滤波----------
  for(i=0;i<n_P;i++) 
        tmp_v[i]=Points[i].p2p;
  for(i=3;i<n_P-3;i++)
  {
    if(abs(tmp_v[i]-tmp_v[i-1])+abs(tmp_v[i]-tmp_v[i+1])>500)
        Points[i].p2p= (tmp_v[i-2]+tmp_v[i-1]+tmp_v[i+1]+tmp_v[i+2])/4;
    Points[i].p2p=(Points[i-1].p2p+Points[i].p2p+Points[i+1].p2p)/3;
  }  
  //--------三点滑移平均------------
  for(i=0;i<n_P;i++) 
        tmp_v[i]=Points[i].p2p;
  for(i=3;i<n_P-3;i++)
  {
    Points[i].p2p=(tmp_v[i-1]+tmp_v[i]+tmp_v[i+1])/3;
  }  
  //---去掉直流分量（整体向下平移）--------------------------
  for(i=3;i<n_P-3;i++)
  {
    if(p2p_min>Points[i].p2p)
    {
      p2p_min=Points[i].p2p;
      //n_min=i;
    }    
  }
  for(i=3;i<n_P-3;i++)
  {
    Points[i].p2p=Points[i].p2p-p2p_min;
  }
  //--寻找最大值及其位置---------------------------
  for(i=3;i<n_P-3;i++)
  {
    if(p2p_max<Points[i].p2p)
    {
      p2p_max=Points[i].p2p;
      n_max=i;
    }    
  }
  //--确定收缩压系数-------------------------------
  if (p2p_max>120 && p2p_max<=135)
    k1=0.52;
  else if (p2p_max>110 && p2p_max<=120)
    k1=0.57;
  else if (p2p_max>70 && p2p_max<=110)
    k1=0.58;
  else if (p2p_max<=70)
    k1=0.64;
  else
    k1=0.45;
   //--确定收缩压系数-------------------------------
  if (p2p_max>120 && p2p_max<=140)
    k2=0.85;
  else if (p2p_max>60 && p2p_max<=120)
    k2=0.78;
  else if (p2p_max>50 && p2p_max<=60)
    k2=0.60;
  else if (p2p_max<=50)
    k2=0.50;
  else
    k2=0.85;
  //-------用系数找舒张压-------
  for(i=n_max;i<n_P-3;i++)
  {
    low=Points[i].bp;
    if(Points[i].p2p<(int)(k1*p2p_max))//系数待计算
    {
      break;
    }
  }
  //-------用系数找收缩压-------
  for(i=n_max;i>2;i--)
  {
   high=Points[i].bp;
   if(Points[i].p2p<(int)(k2*p2p_max))//系数待计算
    {
      break;
    }
  }  
  DIA=adc2mmhg(low);
  SYS=adc2mmhg(high);  
  //---零点修正----------  
  //BP_High=BP_High-90;
  //BP_Low=BP_Low-70; 
  if (DIA<=40)
    DIA=DIA-29;
  else if (DIA>40 && DIA<=50)
    DIA=DIA-9;
  else if (DIA>50 && DIA<=60)
    DIA=DIA-4;
  else if (DIA>60 && DIA<=90)
    DIA=DIA+2;
  else if (DIA>90 && DIA<=120)
    DIA=DIA+4;
  else
    DIA=DIA+9;
  
  if (SYS<=70)
    SYS=SYS-2;
  else if (SYS>70 && SYS<=90)
    SYS=SYS+3;
  else if (SYS>90 && SYS<=110)
    SYS=SYS+6;
  else if (SYS>110 && SYS<=160)
    SYS=SYS+12;
  else
    SYS=SYS+18;  
  BP_High=SYS;
  BP_Low=DIA; 
}
/*****************************************************************************
UART接收数据处理
*****************************************************************************/
void RBUF_PROCESS(void)  //在主程序中调用
{
    
