zeroWin/BP_MSP430/main.c
  if(RBUF[2]==0x03)      //启动一次血压测量
  {
   step=0;
   CCTL0 |= CCIE;   
  } 

  else if(RBUF[2]==0x06) //停止血压测量
  {
   step =101;
   CCTL0 &= ~CCIE;
   PUMP_OFF();
   VALVE_ON();
   delay_s(5);
   VALVE_OFF();
   
  } 
 
  else if(RBUF[2]==0x30)//相关参数配置
  {
    if(RBUF[3]==0x01)   //配置采样率为128Hz
    {
    CCR0 = 128-1;
    }
    if(RBUF[3]==0x02)   //配置采样率为256Hz
    {
    CCR0 = 64-1;
    }
    if(RBUF[3]==0x03)   //配置采样率为512Hz
    {
    CCR0 = 32-1;
    }
    if(RBUF[3]==0x04)   //配置预设压力值为2900
    {
    Prepressure=2900;
    }
    if(RBUF[3]==0x05)   //配置预设压力值为2800
    {
    Prepressure=2800;
    }
    if(RBUF[3]==0x06)   //配置预设压力值为2700
    {
    Prepressure=2700;
    }
    if(RBUF[3]==0x07)   //配置波特率为115200
    {
    UBR00 = 0x45;                             
    UBR10 = 0x00;                             
    UMCTL0 =0x2C; 
    }
    if(RBUF[3]==0x08)   //配置波特率为38400
    {
    UBR00 = 0xD0;
    UBR10 = 0x00;                             
    UMCTL0 = 0x00;
    }
    if(RBUF[3]==0x09)   //配置波特率为19200
    {
    UBR00 = 0xA0;
    UBR10 = 0x01;                             
    UMCTL0 = 0x00;
    }    
  }  
  RBUF_NEED_PROCESS=0;  
}
/*****************************************************************************
定时器A中断服务程序
*****************************************************************************/
#pragma vector=TIMERA0_VECTOR
__interrupt void Timer_A (void)
{
     static long BP_AC_AVE=0;  
     static long BP_AC_AVE_times=0;
     P2OUT ^= 0x10;     
     ADC12CTL0 |= ADC12SC;                     // Start conversion
     BP_DC = ADC12MEM0;                        // Move A0 results
     BP_AC = ADC12MEM1;                        // Move A1 results
     if(delay_times<30000)
     delay_times++;                            //延时次数累加
     if(display_time==255)
     {
       display_time=0;
       show=1;
     }
     else
     {
       display_time++;
     }       
     //pressure=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     bp=((BP_DC*3.3/4095)/233.56)*1000*15.52;
     pressure=(u32)(bp);
     if(show==1)
                {
                show=0;
                if(pressure<10)
                {
                OLED_ShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
                OLED_ShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,0,1,32);
                OLED_ShowNum(SPO2_Show2Num_Start_X+59,SPO2_Show2Num_Start_Y,pressure,1,32);
                }
                else if((pressure<100)&&(pressure>9))
                {
                OLED_ShowNum(SPO2_Show2Num_Start_X+27,SPO2_Show2Num_Start_Y,0,1,32);
                OLED_ShowNum(SPO2_Show2Num_Start_X+43,SPO2_Show2Num_Start_Y,pressure,2,32);
                }
                else
                OLED_ShowNum(SPO2_Show3Num_Start_X+27,SPO2_Show3Num_Start_Y,pressure,3,32);
                OLED_Refresh_Gram();             
                }
     switch(step)
       {       
       case 0:                                    //变量初始化
                delay_times=0;
                BP_AC_AVE=0;
                BP_AC_AVE_times=0;
                BP_MIN=BP_AC_AVE;
                BP_MAX=0;
                AC_MAX=0;
                last_is_low=0;
                is_BP_messure_finished=0;                  
                step=5;
                break;
       case 5:                                   //BP_AC基准求取并控制气泵充气
                BP_AC_AVE+=BP_AC;
                BP_AC_AVE_times++;
                if(BP_AC_AVE_times>=128)
                 { 
                   BP_AC_AVE=BP_AC_AVE>>7;
                   PUMP_ON(0x0100);             //开始充气
                   step=10;
                 }                
                break;
       case 10:                                 //判断是否到达预置压力
                if(BP_DC>=Prepressure)
                 {
                   PUMP_OFF();                  //停止充气，此时匀速泄气阀已经开始泄气
                   //delay_s(2);
                   delay_times=0;
                   BP_MIN=BP_AC_AVE;
                   BP_MAX=0;
                   last_is_low=1;
                   n_P=0;                       //number of points
                   step=20;
                 }
                break;  
       case 20:                                 //将BP_DC和BP_AC通过串口发送                 
                value1=BP_DC;                   //发送袖带静态压力
                //value1=0x0123;
                ch1=(value1&0x000F)|0x10;
                TXBUF0 = ch1;
                while(!(U0TCTL & TXEPT));
                ch1=(value1&0x00F0)>>4|0x20;
                TXBUF0 = ch1;
                while(!(U0TCTL & TXEPT));
                ch1=(value1&0x0F00)>>8|0x30;
                TXBUF0 = ch1;
                while(!(U0TCTL & TXEPT));       //发送脉搏波数据
                value2=BP_AC;
                ch2=(value2&0x000F)|0x40;
                TXBUF0 = ch2;
                while(!(U0TCTL & TXEPT));
                ch2=(value2&0x00F0)>>4|0x50;
                TXBUF0 = ch2;
                while(!(U0TCTL & TXEPT));
                ch2=(value2&0x0F00)>>8|0x60;
                TXBUF0 = ch2;
                while(!(U0TCTL & TXEPT));       //发送开始                
                if(last_is_low==1)
                {
                 if(BP_AC>BP_AC_AVE)
                 {
                   last_is_low=0;
                   Points[n_P].bp=BP_DC;
                   delay_times=0;
                 }                
                }
                else
                {
                 if(BP_MAX<BP_AC)BP_MAX=BP_AC;
                 if(BP_AC<BP_AC_AVE && delay_times>=250)
                 {
                  last_is_low=1;
                  BP_P2P=BP_MAX;
                  Points[n_P].p2p=BP_MAX;
                  if(n_P<99)n_P++;             //number of points
                  BP_MAX=BP_AC_AVE;
                 }
                }              
                if(BP_DC<930)                  //快速放气
                {
                 PUMP_OFF();
                 VALVE_ON();
                 //delay_s(5);
                }      
                if(BP_DC<300)
                {
                 PUMP_OFF();
                 VALVE_OFF();
                 step=30;
                }
                break;
       case 40:  
               step=101; 
               PUMP_OFF();
               VALVE_ON();
               break;
       default:
               PUMP_OFF();
               VALVE_ON();
               break;
       }
}
/*****************************************************************************
UART中断服务程序
*****************************************************************************/
#pragma vector=USART0RX_VECTOR
__interrupt void USART0_RX_ISR(void)
{
 unsigned char ch;
 ch=RXBUF0;   
  if(R_SP<2)                          //帧头判别
    {
	if(ch==hello[R_SP])R_SP++;
	else R_SP=0;
	}
  else if(R_SP<4)                     //帧数据
    {
	     RBUF[R_SP]=ch;
	     R_SP++;
    }
  else if(ch==hello[3])               //帧尾判别
         {
		 R_SP=0;
		 if(RBUF_NEED_PROCESS==0)
		      {
			  RBUF_NEED_PROCESS=1;
		       }
		 }  
  else 
  {
    RBUF_NEED_PROCESS=1;
    R_SP=0;
  }
  }
/************************************************************************
                        按键控制中断服务程序																                 
*************************************************************************/
#pragma vector=PORT1_VECTOR
__interrupt void Port_1(void)
{    
    P1IE &= ~BIT3;                                                         //P1.3 interrupt DISABLE
    Device_waite_time1 = 0;                                                //等待状态计数值清0
    if(Device_status == DEVICE_SLEEP)                                      //处于睡眠态，长按短按都是进入等待态
    {
      Device_status = DEVICE_WAIT;
      LPM4_EXIT;
      OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
      OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
      Show_Wait_Symbol();    
      OLED_Refresh_Gram();
      delay_ms(10);  
    }
    else                                                                   //处于等待状态或是测量状态有按键按下
    {
      int Press_type = 0;                                                  //0表示短按，1表示长按
      //判断是长按还是短按
      for(Press_type = 0;Press_type < 1000; Press_type++)                  //按下约3s
      {
        if(P1IN&BIT3)                                                      //P1.3是高电平，表示松开按键
          break;
        delay_ms(2);
      }
      if(Press_type != 1000)                                               //短按
        Press_type = 0;
      else
        Press_type = 1;                                                    //长按
      if(Device_status == DEVICE_WAIT)                                     //处于等待状态
      {
        if(Press_type == 0)                                                //短按，开始测量
        {
          Device_status = DEVICE_MEASURE;
          VALVE_OFF();
          if(step==101) 
                {
                step=0;
                CCTL0 |= CCIE;                        //启动定时器A中断
                OLED_Clear();
                OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
                OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
                Show_Wait_Symbol(); 
                OLED_ShowString(SPO2_Symbol_Start_X,0,12,"Go       ");
                OLED_ShowString(0,30,32,"        ");  //8个空格，完全清空
                OLED_Refresh_Gram();                
                delay_ms(10);
                }
                else 
                {
                step =101;
                OLED_Clear();
                OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
                OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
                Show_Wait_Symbol();    
                OLED_Refresh_Gram();              
                delay_ms(10);
                }
        }
        else//长按，关屏
        {
          Device_status = DEVICE_SLEEP;
          step=101;
        }
      }
      else if(Device_status == DEVICE_MEASURE)//处于测量状态
      {
        if(Press_type == 0)//短按，停止测量
        {
          Device_status = DEVICE_WAIT;
          PUMP_OFF();
          VALVE_ON();
          CCTL0 &= ~CCIE;
          OLED_Clear();
          OLED_ShowString(SPO2_Symbol_Start_X+16,SPO2_Symbol_Start_Y,16,"SYS");
          OLED_ShowString(PR_Symbol_Start_X,PR_Symbol_Start_Y,16,"DIA");    
          Show_Wait_Symbol();    
          OLED_Refresh_Gram();
          step=101;  
        }
        else//长按，关屏
        {
          PUMP_OFF();
          VALVE_OFF();
          Device_status = DEVICE_SLEEP;
          OLED_Clear();
          step=101;
        }
      }
    }
    P1IFG &= ~BIT3;             // P1.6 IFG cleared
    P1IE |= BIT3;               // P1.7 interrupt enabled
  
  }


